app/controllers/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @member = Member.all

INSERT INTO "members" ("username", "email", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?)
---
  def create

    @member = Member.new(member_params) # Not the final implementation!
    @member.toggle!(:admin) if logged_in?
    if @member.save

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "members" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["email", "arjunasdf@gmail.co"], ["password_digest", "$2a$10$RENwlRTkEpfTbw0do0699.M0VJHV60rhSnFhUd1VL8O1MMM8r7tL."], ["updated_at", 2016-09-24 01:52:47 UTC], ["id", 13]]
---
  def update
    @member = Member.find(params[:id])
    if @member.update_attributes(member_params)