app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("number", "building", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", "121"], ["building", "dh hill"], ["size", "2"], ["created_at", 2016-09-24 16:48:07 UTC], ["updated_at", 2016-09-24 16:48:07 UTC]]